In [1]:
import pandas as pd

In [3]:
titanic = pd.read_csv(r"C:\Users\User\Desktop\titanic.csv")

In [4]:
titanic

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,Pears,Mrs. Thomas (Edith Wearne),female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,Meo,Mr. Alfonzo,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,van Billiard,Mr. Austin Blyler,male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,Olsen,Mr. Ole Martin,male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,Williams,Mr. Charles Duane,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [5]:
titanic.head()

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic["Name"].str.lower()

0                                  mr. owen harris
1       mrs. john bradley (florence briggs thayer)
2                                      miss. laina
3               mrs. jacques heath (lily may peel)
4                                mr. william henry
                          ...
151                     mrs. thomas (edith wearne)
152                                    mr. alfonzo
153                              mr. austin blyler
154                                 mr. ole martin
155                              mr. charles duane
Name: Name, Length: 156, dtype: object

In [7]:
titanic["Name"].str.split(",")

0                                 [ Mr. Owen Harris]
1      [ Mrs. John Bradley (Florence Briggs Thayer)]
2                                     [ Miss. Laina]
3              [ Mrs. Jacques Heath (Lily May Peel)]
4                               [ Mr. William Henry]
                           ...
151                    [ Mrs. Thomas (Edith Wearne)]
152                                   [ Mr. Alfonzo]
153                             [ Mr. Austin Blyler]
154                                [ Mr. Ole Martin]
155                             [ Mr. Charles Duane]
Name: Name, Length: 156, dtype: object

In [8]:
titanic["Surname"] = titanic["Name"].str.split(",").str.get(0)

In [9]:
titanic["Surname"]

0                                  Mr. Owen Harris
1       Mrs. John Bradley (Florence Briggs Thayer)
2                                      Miss. Laina
3               Mrs. Jacques Heath (Lily May Peel)
4                                Mr. William Henry
                          ...
151                     Mrs. Thomas (Edith Wearne)
152                                    Mr. Alfonzo
153                              Mr. Austin Blyler
154                                 Mr. Ole Martin
155                              Mr. Charles Duane
Name: Surname, Length: 156, dtype: object

In [10]:
titanic["Name"].str.contains("Countess")

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Name: Name, Length: 156, dtype: bool

In [11]:
titanic[titanic["Name"].str.contains("Countess")]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Lname, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Surname]
Index: []

In [12]:
titanic["Name"].str.len()

0      16
1      43
2      12
3      35
4      18
       ..
151    27
152    12
153    18
154    15
155    18
Name: Name, Length: 156, dtype: int64

In [13]:
titanic["Name"].str.len().idxmax()

25

In [14]:
titanic.loc[titanic["Name"].str.len().idxmax(), "Name"]

' Mrs. Carl Oscar (Selma Augusta Emilia Johansson)'

In [15]:
titanic["Sex_short"] = titanic["Sex"].replace({"male": "M", "female": "F"})

In [16]:
titanic["Sex_short"]

0      M
1      F
2      F
3      F
4      M
      ..
151    F
152    M
153    M
154    M
155    M
Name: Sex_short, Length: 156, dtype: object